Tutorial 7 - CO2 Storage in Brine Aquifers in OpenFOAM - PitzDaily Case/Case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e7; //20e3; //0;

boundaryField
{
    inlet
    {
        type		zeroGradient;
	//type            darcyGradPressure;
        //value           uniform 0.05681818181818181818181818181818e-5*1e4; //2.5e-4*0.5*0.2/44 or 5e-7*0.5/(0.1*0.1*44)
    }
    outlet
    {
       	type            fixedValue ;
       	value		uniform 1e7;     
    }
    upperWall
    {
	type		darcyGradPressure;
	value		uniform 0;
    }
    lowerWall
    {
	type		darcyGradPressure;
	value		uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
