Tutorial 7 - CO2 Storage in Brine Aquifers in OpenFOAM - PitzDaily Case/Case/0/Ub
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{

    inlet
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }
    lowerWall
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }

}


//************************************************* //
