Tutorial 7 - CO2 Storage in Brine Aquifers in OpenFOAM - PitzDaily Case/Case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear corrected; // none;
}

laplacianSchemes
{
    default         	Gauss linear corrected;;
}

interpolationSchemes
{
    default		none;
    K			harmonic;
    pc		        linear;
    kra	                upwind phia;
    krb         	upwind phib;
    flux(U)             linear;
    UCO2		linear;
    UH2O		linear;
    PHf 		linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p           ;
}

// ************************************************************************* //
